AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/ПараметрыУчетаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыУчетаОС</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаНУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыНалоговогоУчетаОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛиквидационнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокСлужбы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияРасходовПоАмортизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентУскорения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособПоступления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПоступленияАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВводаВЭксплуатацию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НалоговаяАмортизация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НалоговаяАмортизация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БалансоваяСтоимостьНаНачалоГода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПоступленияНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПоступленияОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВыбытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВыбытияНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВыбытияОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыНаРемонт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаРемонт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПревышениеЗатратНаРемонт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БалансоваяСтоимостьНаКонецГода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БалансоваяСтоимостьИтого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АмортизацияЗаГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УвеличениеСОД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВычетМеньше100РП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВводаВЭксплуатацию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЛетЭксплуатации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазаПрямолинейнойАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаНУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыНалоговогоУчетаОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОС</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСостоянийОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСостоянийОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступило</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РасчетНалогаНаПрибыльСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает текст запроса для расчета налоговой амортизации в документе ЗакрытиеМесяца.
//
Функция ТекстЗапросаПоРасчетуНалоговойАмортизацииВДокументеЗакрытиеМесяца() Экспорт
	
	ТекстЗапроса = ТекстЗапроса_ВременнаяТаблицаНалоговаяАмортизация() 								+ Разделитель()
		+ ТекстЗапроса_ВременнаяТаблицаДвижениеОС() 												+ Разделитель()
	 	+ ТекстЗапроса_УничтожитьВременнуюТаблицу("ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС") 	+ Разделитель()
	  //+ ТекстЗапроса_ВременнаяТаблицаДвижениеОСРезультат() 										+ Разделитель()
	  //  + ТекстЗапроса_УничтожитьВременнуюТаблицу("ВременнаяТаблицаДвижениеОС") 					+ Разделитель()
	 	+ ТекстЗапроса_ВременнаяТаблицаЗатратыНаРемонт()											+ Разделитель()
	 	+ ТекстЗапроса_ВременнаяТаблицаСписокГрупп() 												+ Разделитель()
		+ ТекстЗапроса_ВременнаяТаблицаПолныйСписок() 												+ Разделитель()
		+ ТекстЗапроса_ВременнаяТаблицаКоличествоВГруппах() 										+ Разделитель()
		+ ТекстЗапроса_УничтожитьВременнуюТаблицу("ВременнаяТаблицаСписокОС") 						+ Разделитель()
		+ ТекстЗапроса_ДляДокументаЗакрытиеМесяца() 												+ Разделитель();
		
	Возврат ТекстЗапроса;

КонецФункции 

// Функция возвращает текст запроса для расчета налоговой амортизации в мониторе по налогу на прибыль.
//
Функция ТекстЗапросаПоРасчетуНалоговойАмортизацииВМонитореНП() Экспорт
	
	ТекстЗапроса = ТекстЗапроса_ВременнаяТаблицаНалоговаяАмортизация() 								+ Разделитель()
		+ ТекстЗапроса_ВременнаяТаблицаДвижениеОС() 												+ Разделитель()
	 	+ ТекстЗапроса_УничтожитьВременнуюТаблицу("ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС") 	+ Разделитель()
	  //+ ТекстЗапроса_ВременнаяТаблицаДвижениеОСРезультат() 										+ Разделитель()
	  //  + ТекстЗапроса_УничтожитьВременнуюТаблицу("ВременнаяТаблицаДвижениеОС") 					+ Разделитель()
	 	+ ТекстЗапроса_ВременнаяТаблицаСписокГрупп_МониторНП()										+ Разделитель()
		+ ТекстЗапроса_ЗатратыНаРемонт_МониторНП()													+ Разделитель()
		+ ТекстЗапроса_ДляМонитораНП()																+ Разделитель();
	Возврат ТекстЗапроса;

КонецФункции

// Функция возвращает текст запроса ВременнаяТаблицаЗатратыНаРемонт.
// 
Функция ТекстЗапроса_ЗатратыНаРемонт_МониторНП()
	// Затраты на ремонт.
	ТекстЗапроса =	
		"ВЫБРАТЬ
		|	ПараметрыУчетаОС.ГруппаНУ КАК ГруппаНУ,
		|	ПараметрыУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
		|	ХозрасчетныйОбороты.СуммаОборот КАК ЗатратыНаРемонт,
		|	ХозрасчетныйОбороты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВременнаяТаблицаЗатратыНаРемонт
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&НачалоГода,
		|			&КонецГода,
		|			Авто,
		|			Счет В (&СчетаЗатратНаРемонтОС),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|			Организация = &Организация
		|				И (Субконто1 = &ОсновноеСредство
		|					ИЛИ &ОсновноеСредство = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)),
		|			,
		|			) КАК ХозрасчетныйОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаОС.СрезПоследних(
		|				&КонецГода,
		|				Организация = &Организация
		|					И (ГруппаНУ = &ГруппаНУ
		|						ИЛИ &ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.ПустаяСсылка))
		|					И (ОсновноеСредство = &ОсновноеСредство
		|						ИЛИ &ОсновноеСредство = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))) КАК ПараметрыУчетаОС
		|		ПО ХозрасчетныйОбороты.Субконто1 = ПараметрыУчетаОС.ОсновноеСредство";
		
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыРасчетаНалоговойАмортизации

// Функция возвращает текст запроса ВременнаяТаблицаНалоговаяАмортизация.
// 
Функция ТекстЗапроса_ВременнаяТаблицаНалоговаяАмортизация()
	// Данные Налоговой амортизации за пред.год. 
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НалоговаяАмортизация.ГруппаНУ КАК ГруппаНУ,
		|	НалоговаяАмортизация.ОсновноеСредство КАК ОсновноеСредство,
		|	НалоговаяАмортизация.БалансоваяСтоимостьНаКонецГода КАК БалансоваяСтоимостьНаКонецПрошлыйГод,
		|	НалоговаяАмортизация.АмортизацияЗаГод КАК АмортизацияЗаПрошлыйГод,
		|	НалоговаяАмортизация.СуммаПоступленияОстаток КАК СуммаПоступленияОстатокПрошлыйГод,
		|	НалоговаяАмортизация.СуммаВыбытияОстаток КАК СуммаВыбытияОстатокПрошлыйГод,
		|	НалоговаяАмортизация.БазаПрямолинейнойАмортизации КАК БазаПрямолинейнойАмортизацииПоршлыйГод
		|ПОМЕСТИТЬ ВременнаяТаблицаНалоговаяАмортизация
		|ИЗ
		|	РегистрСведений.НалоговаяАмортизация КАК НалоговаяАмортизация
		|ГДЕ
		|	НалоговаяАмортизация.Организация = &Организация
		|	И НалоговаяАмортизация.Год = &НачалоПрошлогоГода";
	
	Возврат ТекстЗапроса;
	
КонецФункции 

// Функция возвращает текст запроса ВременнаяТаблицаДвижениеОС.
// 
Функция ТекстЗапроса_ВременнаяТаблицаДвижениеОС()
	// Поступление ОС.
	// Выбытие ОС.	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДвижениеОСНУОбороты.ГруппаНУ КАК ГруппаНУ,
		|	ДвижениеОСНУОбороты.ОсновноеСредство КАК ОсновноеСредство,
		|	ДвижениеОСНУОбороты.Регистратор КАК Регистратор,
		|	МЕСЯЦ(ДвижениеОСНУОбороты.ПериодМесяц) КАК МесяцПоступления,
		|	0 КАК МесяцВыбытия,
		|	ДвижениеОСНУОбороты.ПоступлениеОборот КАК СуммаПоступления,
		|	0 КАК СуммаВыбытия,
		|	ДвижениеОСНУОбороты.ТекущееПоступлениеОборот КАК СуммаПоступленияНУ,
		|	ДвижениеОСНУОбороты.ТекущееВыбытиеОборот КАК СуммаВыбытияНУ
		|ПОМЕСТИТЬ ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС
		|ИЗ
		|	РегистрНакопления.ДвижениеОСНУ.Обороты(
		|			&НачалоГода,
		|			&КонецГода,
		|			Авто,
		|			Организация = &Организация
		|				И (ГруппаНУ = &ГруппаНУ
		|					ИЛИ &ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.ПустаяСсылка))
		|				И (ОсновноеСредство = &ОсновноеСредство
		|					ИЛИ &ОсновноеСредство = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))) КАК ДвижениеОСНУОбороты
		|ГДЕ
		|	ДвижениеОСНУОбороты.ПоступлениеОборот > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДвижениеОСНУОбороты.ГруппаНУ,
		|	ДвижениеОСНУОбороты.ОсновноеСредство,
		|	ДвижениеОСНУОбороты.Регистратор,
		|	0,
		|	МЕСЯЦ(ДвижениеОСНУОбороты.ПериодМесяц),
		|	0,
		|	ДвижениеОСНУОбороты.ВыбытиеОборот,
		|	ДвижениеОСНУОбороты.ТекущееПоступлениеОборот,
		|	ДвижениеОСНУОбороты.ТекущееВыбытиеОборот
		|ИЗ
		|	РегистрНакопления.ДвижениеОСНУ.Обороты(
		|			&НачалоГода,
		|			&КонецГода,
		|			Авто,
		|			Организация = &Организация
		|				И (ГруппаНУ = &ГруппаНУ
		|					ИЛИ &ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.ПустаяСсылка))
		|				И (ОсновноеСредство = &ОсновноеСредство
		|					ИЛИ &ОсновноеСредство = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))) КАК ДвижениеОСНУОбороты
		|ГДЕ
		|	ДвижениеОСНУОбороты.ВыбытиеОборот > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.ГруппаНУ КАК ГруппаНУ,
		|	ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.Регистратор КАК Регистратор,
		|	СУММА(ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.МесяцПоступления) КАК МесяцПоступления,
		|	СУММА(ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.МесяцВыбытия) КАК МесяцВыбытия,
		|	СУММА(ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.СуммаПоступления) КАК СуммаПоступления,
		|	СУММА(ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.СуммаВыбытия) КАК СуммаВыбытия,
		|	ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.СуммаПоступленияНУ КАК СуммаПоступленияНУ,
		|	ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.СуммаВыбытияНУ КАК СуммаВыбытияНУ
		|ПОМЕСТИТЬ ВременнаяТаблицаДвижениеОС
		|ИЗ
		|	ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС КАК ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.ГруппаНУ,
		|	ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.ОсновноеСредство,
		|	ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.Регистратор,
		|	ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.СуммаПоступленияНУ,
		|	ВременнаяТаблицаДвижениеПоступлениеВыбытиеОС.СуммаВыбытияНУ";
		
	Возврат ТекстЗапроса;
	
КонецФункции

//// Функция возвращает текст запроса ВременнаяТаблицаДвижениеОСРезультат.
//// 
//Функция ТекстЗапроса_ВременнаяТаблицаДвижениеОСРезультат()
//	// Расчет полных месяцев.
//	ТекстЗапроса = 
//		"ВЫБРАТЬ
//		|	ВременнаяТаблицаДвижениеОС.ГруппаНУ КАК ГруппаНУ,
//		|	ВременнаяТаблицаДвижениеОС.ОсновноеСредство КАК ОсновноеСредство,
//		|	ВременнаяТаблицаДвижениеОС.Регистратор КАК Регистратор,
//		|	ВременнаяТаблицаДвижениеОС.МесяцПоступления КАК МесяцПоступления,
//		|	ВременнаяТаблицаДвижениеОС.МесяцВыбытия КАК МесяцВыбытия,
//		|	ВременнаяТаблицаДвижениеОС.СуммаПоступления КАК СуммаПоступления,
//		|	ВременнаяТаблицаДвижениеОС.СуммаВыбытия КАК СуммаВыбытия,
//		|	ВременнаяТаблицаДвижениеОС.СуммаПоступленияНУ КАК СуммаПоступленияНУ,
//		|	ВременнаяТаблицаДвижениеОС.СуммаВыбытияНУ КАК СуммаВыбытияНУ,		
//		|	ВЫБОР
//		|		КОГДА ВременнаяТаблицаДвижениеОС.МесяцВыбытия = ВременнаяТаблицаДвижениеОС.МесяцПоступления
//		|			ТОГДА 0
//		|		КОГДА ВременнаяТаблицаДвижениеОС.МесяцВыбытия = 0
//		|			ТОГДА 12 - ВременнаяТаблицаДвижениеОС.МесяцПоступления
//		|		КОГДА НЕ ВременнаяТаблицаДвижениеОС.МесяцВыбытия = ВременнаяТаблицаДвижениеОС.МесяцПоступления
//		|			ТОГДА ВременнаяТаблицаДвижениеОС.МесяцВыбытия - ВременнаяТаблицаДвижениеОС.МесяцПоступления - 1
//		|		ИНАЧЕ 12
//		|	КОНЕЦ КАК КоличествоПолныхМесяцев
//		|ПОМЕСТИТЬ ВременнаяТаблицаДвижениеОСРезультат
//		|ИЗ
//		|	ВременнаяТаблицаДвижениеОС КАК ВременнаяТаблицаДвижениеОС";
//		
//	Возврат ТекстЗапроса;
//	
//КонецФункции

// Функция возвращает текст запроса ВременнаяТаблицаЗатратыНаРемонт.
// 
Функция ТекстЗапроса_ВременнаяТаблицаЗатратыНаРемонт()
	// Затраты на ремонт.
	ТекстЗапроса =	
		"ВЫБРАТЬ
		|	ПараметрыУчетаОС.ГруппаНУ КАК ГруппаНУ,
		|	ПараметрыУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
		|	ХозрасчетныйОбороты.СуммаОборот КАК ЗатратыНаРемонт
		|ПОМЕСТИТЬ ВременнаяТаблицаЗатратыНаРемонт
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&НачалоГода,
		|			&КонецГода,
		|			,
		|			Счет В (&СчетаЗатратНаРемонтОС),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|			Организация = &Организация
		|				И (Субконто1 = &ОсновноеСредство
		|					ИЛИ &ОсновноеСредство = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)),
		|			,
		|			) КАК ХозрасчетныйОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаОС.СрезПоследних(
		|				&КонецГода,
		|				Организация = &Организация
		|					И (ГруппаНУ = &ГруппаНУ
		|						ИЛИ &ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.ПустаяСсылка))
		|					И (ОсновноеСредство = &ОсновноеСредство
		|						ИЛИ &ОсновноеСредство = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))) КАК ПараметрыУчетаОС
		|		ПО ХозрасчетныйОбороты.Субконто1 = ПараметрыУчетаОС.ОсновноеСредство
		|ГДЕ
		|	НЕ ПараметрыУчетаОС.ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.ПустаяСсылка)";
		
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция возвращает текст запроса ВременнаяТаблицаСписокГрупп.
// 
Функция ТекстЗапроса_ВременнаяТаблицаСписокГрупп()
	// Объединение данных.
	// Определение детализации расчета:
	// * для 5-й группы расчет для каждого ОС
	// * для групп 1,2,3,4,6 расчет для всей группы	
	ТекстЗапроса = 	
		"ВЫБРАТЬ
		|	ВременнаяТаблицаДвижениеОС.ГруппаНУ КАК ГруппаНУ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаДвижениеОС.ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.Группа5)
		|			ТОГДА ВременнаяТаблицаДвижениеОС.ОсновноеСредство
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
		|	КОНЕЦ КАК ОсновноеСредство,
		|	СУММА(ВременнаяТаблицаДвижениеОС.СуммаПоступления) КАК СуммаПоступления,
		|	СУММА(ВременнаяТаблицаДвижениеОС.СуммаВыбытия) КАК СуммаВыбытия,
		|	СУММА(ВременнаяТаблицаДвижениеОС.СуммаПоступленияНУ) КАК СуммаПоступленияНУ,
		|	СУММА(ВременнаяТаблицаДвижениеОС.СуммаВыбытияНУ) КАК СуммаВыбытияНУ,
		|	0 КАК БалансоваяСтоимостьНаКонецПрошлыйГод,
		|	0 КАК АмортизацияЗаПрошлыйГод,
		|	0 КАК СуммаПоступленияОстатокПрошлыйГод,
		|	0 КАК СуммаВыбытияОстатокПрошлыйГод,
		|	0 КАК БазаПрямолинейнойАмортизацииПоршлыйГод,
		|	0 КАК ЗатратыНаРемонт
		|ПОМЕСТИТЬ ВременнаяТаблицаСписокГрупп
		|ИЗ
		|	ВременнаяТаблицаДвижениеОС КАК ВременнаяТаблицаДвижениеОС
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаДвижениеОС.ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.Группа5)
		|			ТОГДА ВременнаяТаблицаДвижениеОС.ОсновноеСредство
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВременнаяТаблицаДвижениеОС.ГруппаНУ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаНалоговаяАмортизация.ГруппаНУ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаНалоговаяАмортизация.ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.Группа5)
		|			ТОГДА ВременнаяТаблицаНалоговаяАмортизация.ОсновноеСредство
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВременнаяТаблицаНалоговаяАмортизация.БалансоваяСтоимостьНаКонецПрошлыйГод,
		|	ВременнаяТаблицаНалоговаяАмортизация.АмортизацияЗаПрошлыйГод,
		|	ВременнаяТаблицаНалоговаяАмортизация.СуммаПоступленияОстатокПрошлыйГод,
		|	ВременнаяТаблицаНалоговаяАмортизация.СуммаВыбытияОстатокПрошлыйГод,
		|	ВременнаяТаблицаНалоговаяАмортизация.БазаПрямолинейнойАмортизацииПоршлыйГод,
		|	0
		|ИЗ
		|	ВременнаяТаблицаНалоговаяАмортизация КАК ВременнаяТаблицаНалоговаяАмортизация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаЗатратыНаРемонт.ГруппаНУ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаЗатратыНаРемонт.ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.Группа5)
		|			ТОГДА ВременнаяТаблицаЗатратыНаРемонт.ОсновноеСредство
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВременнаяТаблицаЗатратыНаРемонт.ЗатратыНаРемонт
		|ИЗ
		|	ВременнаяТаблицаЗатратыНаРемонт КАК ВременнаяТаблицаЗатратыНаРемонт";	
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция возвращает текст запроса ВременнаяТаблицаПолныйСписок.
// 
Функция ТекстЗапроса_ВременнаяТаблицаПолныйСписок()
	// Расчет сумм поступления и выбытия ОС по группам НУ.
	ТекстЗапроса =  
		"ВЫБРАТЬ
		|	ВременнаяТаблицаСписокГрупп.ГруппаНУ КАК ГруппаНУ,
		|	ВременнаяТаблицаСписокГрупп.ОсновноеСредство КАК ОсновноеСредство,
		|	СУММА(ВременнаяТаблицаСписокГрупп.СуммаПоступления) КАК СуммаПоступления,
		|	СУММА(ВременнаяТаблицаСписокГрупп.СуммаВыбытия) КАК СуммаВыбытия,
		|	СУММА(ВременнаяТаблицаСписокГрупп.СуммаПоступленияНУ) КАК СуммаПоступленияНУ,
		|	СУММА(ВременнаяТаблицаСписокГрупп.СуммаВыбытияНУ) КАК СуммаВыбытияНУ,		
		|	СУММА(ВременнаяТаблицаСписокГрупп.БалансоваяСтоимостьНаКонецПрошлыйГод) КАК БалансоваяСтоимостьНаКонецПрошлыйГод,
		|	СУММА(ВременнаяТаблицаСписокГрупп.АмортизацияЗаПрошлыйГод) КАК АмортизацияЗаПрошлыйГод,
		|	СУММА(ВременнаяТаблицаСписокГрупп.СуммаПоступленияОстатокПрошлыйГод) КАК СуммаПоступленияОстатокПрошлыйГод,
		|	СУММА(ВременнаяТаблицаСписокГрупп.СуммаВыбытияОстатокПрошлыйГод) КАК СуммаВыбытияОстатокПрошлыйГод,
		|	СУММА(ВременнаяТаблицаСписокГрупп.БазаПрямолинейнойАмортизацииПоршлыйГод) КАК БазаПрямолинейнойАмортизацииПоршлыйГод,
		|	СУММА(ВременнаяТаблицаСписокГрупп.ЗатратыНаРемонт) КАК ЗатратыНаРемонт
		|ПОМЕСТИТЬ ВременнаяТаблицаПолныйСписок
		|ИЗ
		|	ВременнаяТаблицаСписокГрупп КАК ВременнаяТаблицаСписокГрупп
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаСписокГрупп.ГруппаНУ,
		|	ВременнаяТаблицаСписокГрупп.ОсновноеСредство";
		
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция возвращает текст запроса ВременнаяТаблицаКоличествоВГруппах.
// 
Функция ТекстЗапроса_ВременнаяТаблицаКоличествоВГруппах()
	// Количество ОС в группах.
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПараметрыУчетаОССрезПоследних.ГруппаНУ КАК ГруппаНУ,
		|	ПараметрыУчетаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	ПараметрыУчетаОССрезПоследних.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию
		|ПОМЕСТИТЬ ВременнаяТаблицаСписокОС
		|ИЗ
		|	РегистрСведений.ПараметрыУчетаОС.СрезПоследних(
		|			&КонецГода,
		|			(ГруппаНУ = &ГруппаНУ
		|				ИЛИ &ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.ПустаяСсылка))
		|				И (ОсновноеСредство = &ОсновноеСредство
		|					ИЛИ &ОсновноеСредство = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))) КАК ПараметрыУчетаОССрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОС.СрезПоследних(
		|				&КонецГода,
		|				ОсновноеСредство = &ОсновноеСредство
		|					ИЛИ &ОсновноеСредство = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)) КАК СостоянияОССрезПоследних
		|		ПО ПараметрыУчетаОССрезПоследних.ОсновноеСредство = СостоянияОССрезПоследних.ОсновноеСредство
		|ГДЕ
		|	НЕ ПараметрыУчетаОССрезПоследних.ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.ПустаяСсылка)
		|	И СостоянияОССрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийОС.ПринятоКУчету)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСписокОС.ГруппаНУ КАК ГруппаНУ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаСписокОС.ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.Группа5)
		|			ТОГДА ВременнаяТаблицаСписокОС.ОсновноеСредство
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
		|	КОНЕЦ КАК ОсновноеСредство,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВременнаяТаблицаСписокОС.ОсновноеСредство) КАК КоличествоВГруппах,
		|	МАКСИМУМ(ВременнаяТаблицаСписокОС.ДатаВводаВЭксплуатацию) КАК ДатаВводаВЭксплуатацию
		|ПОМЕСТИТЬ ВременнаяТаблицаКоличествоВГруппах
		|ИЗ
		|	ВременнаяТаблицаСписокОС КАК ВременнаяТаблицаСписокОС
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаСписокОС.ГруппаНУ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаСписокОС.ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.Группа5)
		|			ТОГДА ВременнаяТаблицаСписокОС.ОсновноеСредство
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
		|	КОНЕЦ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция возвращает текст итогового запроса.
// 
Функция ТекстЗапроса_ДляДокументаЗакрытиеМесяца()
	// Результат.
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВременнаяТаблицаПолныйСписок.ГруппаНУ КАК ГруппаНУ,
		|	ВременнаяТаблицаПолныйСписок.ГруппаНУ.Код КАК ГруппаНУКод,
		|	ВременнаяТаблицаПолныйСписок.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаПолныйСписок.ГруппаНУ.НормаАмортизации КАК НормаАмортизации,
		|	ВременнаяТаблицаПолныйСписок.ГруппаНУ.НормаАмортизацииДополнительная КАК НормаАмортизацииДополнительная,
		|	ВременнаяТаблицаПолныйСписок.СуммаПоступления КАК СуммаПоступления,
		|	ВременнаяТаблицаПолныйСписок.СуммаВыбытия КАК СуммаВыбытия,
		
		|	ВременнаяТаблицаПолныйСписок.СуммаПоступленияНУ КАК СуммаПоступленияНУ,
		|	ВременнаяТаблицаПолныйСписок.СуммаВыбытияНУ КАК СуммаВыбытияНУ,
		
		|	ВременнаяТаблицаПолныйСписок.БалансоваяСтоимостьНаКонецПрошлыйГод КАК БалансоваяСтоимостьНаКонецПрошлыйГод,
		|	ВременнаяТаблицаПолныйСписок.АмортизацияЗаПрошлыйГод КАК АмортизацияЗаПрошлыйГод,

		|	ВременнаяТаблицаПолныйСписок.СуммаПоступленияОстатокПрошлыйГод КАК СуммаПоступленияОстатокПрошлыйГод,
		|	ВременнаяТаблицаПолныйСписок.СуммаВыбытияОстатокПрошлыйГод КАК СуммаВыбытияОстатокПрошлыйГод,
		|	ВременнаяТаблицаПолныйСписок.БазаПрямолинейнойАмортизацииПоршлыйГод КАК БазаПрямолинейнойАмортизацииПоршлыйГод,
		
		|	ВременнаяТаблицаПолныйСписок.ЗатратыНаРемонт КАК ЗатратыНаРемонт,
		
		|	ЕСТЬNULL(ВременнаяТаблицаКоличествоВГруппах.ДатаВводаВЭксплуатацию, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВводаВЭксплуатацию,
		|	ЕСТЬNULL(ВременнаяТаблицаКоличествоВГруппах.КоличествоВГруппах, 0) КАК КоличествоВГруппах
		|ИЗ
		|	ВременнаяТаблицаПолныйСписок КАК ВременнаяТаблицаПолныйСписок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКоличествоВГруппах КАК ВременнаяТаблицаКоличествоВГруппах
		|		ПО ВременнаяТаблицаПолныйСписок.ГруппаНУ = ВременнаяТаблицаКоличествоВГруппах.ГруппаНУ
		|			И ВременнаяТаблицаПолныйСписок.ОсновноеСредство = ВременнаяТаблицаКоличествоВГруппах.ОсновноеСредство
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГруппаНУКод";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция возвращает текст запроса ТекстРазделителяЗапросовПакета.
// 
Функция Разделитель()
	
	Возврат ОбщегоНазначенияБПСервер.ТекстРазделителяЗапросовПакета();	
	
КонецФункции

// Функция возвращает текст запроса ТекстРазделителяЗапросовПакета.
// 
Функция ТекстЗапроса_УничтожитьВременнуюТаблицу(ИмяВременнойТаблицы)
	
	Возврат "УНИЧТОЖИТЬ " + ИмяВременнойТаблицы;	
	
КонецФункции

#КонецОбласти

#Область ПроцедурыРасчетаНалоговойАмортизацииДляМонитораНП

// Функция возвращает текст запроса ВременнаяТаблицаСписокГрупп.
// 
Функция ТекстЗапроса_ВременнаяТаблицаСписокГрупп_МониторНП()
	ТекстЗапроса = 	
		"ВЫБРАТЬ
		|	ВременнаяТаблицаДвижениеОС.ГруппаНУ КАК ГруппаНУ,
		|	ВременнаяТаблицаДвижениеОС.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаДвижениеОС.Регистратор КАК Регистратор,
		|	ВременнаяТаблицаДвижениеОС.СуммаПоступления КАК СуммаПоступления,
		|	ВременнаяТаблицаДвижениеОС.СуммаВыбытия КАК СуммаВыбытия,
		|	ВременнаяТаблицаДвижениеОС.СуммаПоступленияНУ КАК СуммаПоступленияНУ,
		|	ВременнаяТаблицаДвижениеОС.СуммаВыбытияНУ КАК СуммаВыбытияНУ
		|ПОМЕСТИТЬ ВременнаяТаблицаСписокГрупп
		|ИЗ
		|	ВременнаяТаблицаДвижениеОС КАК ВременнаяТаблицаДвижениеОС";	
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция возвращает текст запроса ВременнаяТаблицаПолныйСписок.
// 
Функция ТекстЗапроса_ДляМонитораНП()
	// Расчет сумм поступления и выбытия ОС по группам НУ.
	ТекстЗапроса =  
		"ВЫБРАТЬ
		|	ВременнаяТаблицаСписокГрупп.ГруппаНУ КАК ГруппаНУ,
		|	ВременнаяТаблицаСписокГрупп.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаСписокГрупп.Регистратор КАК Документ,
		|	ВременнаяТаблицаСписокГрупп.СуммаПоступления КАК СуммаПоступления,
		|	ВременнаяТаблицаСписокГрупп.СуммаВыбытия КАК СуммаВыбытия,
		|	ВременнаяТаблицаСписокГрупп.СуммаПоступленияНУ КАК СуммаПоступленияНУ,
		|	ВременнаяТаблицаСписокГрупп.СуммаВыбытияНУ КАК СуммаВыбытияНУ,
		|	0 КАК ЗатратыНаРемонт
		|ПОМЕСТИТЬ ВременнаяТаблицаСводМониторНП
		|ИЗ
		|	ВременнаяТаблицаСписокГрупп КАК ВременнаяТаблицаСписокГрупп
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаЗатратыНаРемонт.ГруппаНУ,
		|	ВременнаяТаблицаЗатратыНаРемонт.ОсновноеСредство,
		|	ВременнаяТаблицаЗатратыНаРемонт.Регистратор,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВременнаяТаблицаЗатратыНаРемонт.ЗатратыНаРемонт
		|ИЗ
		|	ВременнаяТаблицаЗатратыНаРемонт КАК ВременнаяТаблицаЗатратыНаРемонт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСводМониторНП.ГруппаНУ КАК ГруппаНУ,
		|	ВременнаяТаблицаСводМониторНП.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаСводМониторНП.Документ КАК Документ,
		|	СУММА(ВременнаяТаблицаСводМониторНП.СуммаПоступления) КАК СуммаПоступления,
		|	СУММА(ВременнаяТаблицаСводМониторНП.СуммаВыбытия) КАК СуммаВыбытия,
		|	СУММА(ВременнаяТаблицаСводМониторНП.СуммаПоступленияНУ) КАК СуммаПоступленияНУ,
		|	СУММА(ВременнаяТаблицаСводМониторНП.СуммаВыбытияНУ) КАК СуммаВыбытияНУ,
		|	СУММА(ВременнаяТаблицаСводМониторНП.ЗатратыНаРемонт) КАК ЗатратыНаРемонт
		|ИЗ
		|	ВременнаяТаблицаСводМониторНП КАК ВременнаяТаблицаСводМониторНП
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаСводМониторНП.ОсновноеСредство,
		|	ВременнаяТаблицаСводМониторНП.Документ,
		|	ВременнаяТаблицаСводМониторНП.ГруппаНУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГруппаНУ,
		|	ОсновноеСредство,
		|	Документ";
		
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
